In [1]:
pip install pandas

^C
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
s = pd.Series([1, 2, 3, 4])

s

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s = pd.Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])
s

A    1
B    2
C    3
D    4
dtype: int64

In [5]:
data = [ [1,444,'habiba'],
        [2,555,'mohamed'],
        [3,666,'ali'],
        [4,777,'salah'],

        [6,999,'ahmed']
        ]
df = pd.DataFrame(data, columns=['index', 'std_id', 'name'])
df

   index  std_id     name
0      1     444   habiba
1      2     555  mohamed
2      3     666      ali
3      4     777    salah
4      6     999    ahmed

In [6]:
data = {'index' : [1,444,'habiba'],
        'std_id': [2,555,'mohamed'],
    
}
df = pd.DataFrame(data)
df

    index   std_id
0       1        2
1     444      555
2  habiba  mohamed

In [15]:
data = pd.DataFrame([ [1,444,'habiba'],
        [2,555,'mohamed'],
        [3,666,'ali'],
        [4,777,'salah'],

        [6,999,'ahmed']
        ])

cols = ['A', 'B']
df.columns = cols
idx = ['row 1','row2','row 3']
df.index = idx
display(df)

            A        B
row 1       1        2
row2      444      555
row 3  habiba  mohamed

In [17]:
data = [ [1,444,'habiba'],
        [2,555,'mohamed'],
        [3,666,'ali'],
        [4,777,'salah'],

        [6,999,'ahmed']
        ]
df = pd.DataFrame(data, columns=['index', 'std_id', 'name'])
df

   index  std_id     name
0      1     444   habiba
1      2     555  mohamed
2      3     666      ali
3      4     777    salah
4      6     999    ahmed

In [19]:
df['name'].dtype

dtype('O')

In [20]:
df['std_id'] = df['std_id'].astype('category')
df.dtypes

index        int64
std_id    category
name        object
dtype: object

In [21]:
cols = ['index','name']
df[cols]= df[cols].astype('category')
df.dtypes

index     category
std_id    category
name      category
dtype: object

In [22]:
df['index'] = df['index'].astype('int')
df.dtypes

index        int64
std_id    category
name      category
dtype: object

In [23]:
df.head()

   index std_id     name
0      1    444   habiba
1      2    555  mohamed
2      3    666      ali
3      4    777    salah
4      6    999    ahmed

In [25]:
df.tail(2)

   index std_id   name
3      4    777  salah
4      6    999  ahmed

In [27]:
data = [ [1,1,'habiba'],
        [2,2,'mohamed'],
        [3,3,'ali'],
        [4,4,'salah'],

        [6,100,'ahmed']
        ]
df = pd.DataFrame(data, columns=['index', 'std_id', 'name'])
df

   index  std_id     name
0      1       1   habiba
1      2       2  mohamed
2      3       3      ali
3      4       4    salah
4      6     100    ahmed

In [29]:
df.describe(include='int')

          index      std_id
count  5.000000    5.000000
mean   3.200000   22.000000
std    1.923538   43.617657
min    1.000000    1.000000
25%    2.000000    2.000000
50%    3.000000    3.000000
75%    4.000000    4.000000
max    6.000000  100.000000

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   5 non-null      int64
 1   std_id  5 non-null      int64
 2   name    5 non-null      object
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [ ]:
df['name'].unique()

array(['habiba', 'mohamed', 'ali', 'salah', 'ahmed'], dtype=object)

In [32]:
df['std_id'].max()

np.int64(100)

In [33]:
df['std_id'].idxmax()

4

In [34]:
df['std_id'].idxmin()

0

In [36]:
df['name'].value_counts()

name
habiba     1
mohamed    1
ali        1
salah      1
ahmed      1
Name: count, dtype: int64

In [37]:
df['std_id'].sum()

np.int64(110)

In [38]:
df.max()

index         6
std_id      100
name      salah
dtype: object

In [40]:
df.values

array([[1, 1, 'habiba'],
       [2, 2, 'mohamed'],
       [3, 3, 'ali'],
       [4, 4, 'salah'],
       [6, 100, 'ahmed']], dtype=object)

In [41]:
df.replace(100,'ahmed')

   index std_id     name
0      1      1   habiba
1      2      2  mohamed
2      3      3      ali
3      4      4    salah
4      6  ahmed    ahmed

In [42]:
df.replace({4 :'amir'})

  index std_id     name
0     1      1   habiba
1     2      2  mohamed
2     3      3      ali
3  amir   amir    salah
4     6    100    ahmed

In [45]:
df.std_id.iloc[0:2]

0    1
1    2
Name: std_id, dtype: int64

In [50]:
df.iloc[:,:-1]

   index  std_id
0      1       1
1      2       2
2      3       3
3      4       4
4      6     100

In [51]:
new_col = df.index + df.std_id
df.insert(3,'new_cols', new_col)

In [52]:
x=df.iloc[:,:]
x

   index  std_id     name  new_cols
0      1       1   habiba         1
1      2       2  mohamed         3
2      3       3      ali         5
3      4       4    salah         7
4      6     100    ahmed       104

In [53]:
df.drop('new_cols', axis=1)

   index  std_id     name
0      1       1   habiba
1      2       2  mohamed
2      3       3      ali
3      4       4    salah
4      6     100    ahmed

In [ ]:
new_row = {'index': 5,}
df.append(new_row)